package Collection;

public class CollectionsException {

    /*
UnsupportedOperationException это исключение возникает в том случае, если коллекция не может
быть изменена.

ClassCastException генерируется в том случае, если объекты несовместимы,
например при попытке ввести несовместимый объект в коллекцию.

Исключение типа NullPointerException генерируется
при попытке ввести пустое значение null в коллекцию, не допускающую
наличие пустых элементов.

Исключение типа IllegalArgumentException
генерируется в том случае, если указан неверный аргумент.

А исключение типа IllegalStateException генерируется при попытке ввести новый элемент
в заполненную коллекцию фиксированной длины.
     */
}
